# Звездный прямоугольник
"""
Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

"""
"""
height = 4
width = 17

print('*****************')
print('*               *')
print('*               *')
print('*****************')
"""
"""
# v2
s1 = '*' * 17
s2 = '*' + ' ' * 15 + '*'
print(s1, s2, s2, s1, sep='\n')
"""
# v3
s1, s2 = '*', ' '
print(s1 * 17, s1 + s2 * 15 + s1, s1 + s2 * 15 + s1, s1 * 17, sep='\n')
