# Звездный прямоугольник
"""
Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).

"""

height = 4
width = 17

print('*****************')
print('*               *')
print('*               *')
print('*****************')
