# кастомные разделитель
# Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.

# разделитель
separator = input('Введите сепаратор:\n')

str_1 = input('Введите первую строку:\n')
str_2 = input('Введите вторую строку:\n')
str_3 = input('Введите третью строку:\n')
print(str_1, str_2, str_3, sep=separator)


