# Целочисленные операторы

"""
Язык Python предоставляет четыре основных арифметических оператора для работы с целыми числами (+, −, *, /),
 а также три дополнительных (% для остатка, // для целочисленного деления и ** для возведения в степень).
"""

a = 13
b = 7

total = a + b
diff = a - b
prod = a * b
div1 = a / b
div2 = a // b
mod = a % b
exp = a ** b

print(a, '+', b, '=', total)
print(a, '-', b, '=', diff)
print(a, '*', b, '=', prod)
print(a, '/', b, '=', div1)
print(a, '//', b, '=', div2)
print(a, '%', b, '=', mod)
print(a, '**', b, '=', exp)
