# Удали меня полностью
"""
На вход программе подается строка текста. Напишите программу, которая удаляет все вхождения символа «@».
"""

# 123@1@@34
s = input()
print(s.replace('@', ''))
