# Список чисел
"""
На вход программе подается одно число n. Напишите программу, которая выводит список [1, 2, 3, ..., n].
"""

lst = list(range(1, int(input()) + 1))
print(lst)
