# Расстояние в метрах
# Напишите программу, которая находит полное число метров по заданному числу сантиметров.

"""
Формат входных данных
На вход программе подаётся натуральное число – количество сантиметров.

Формат выходных данных
Программа должна вывести одно число – полное число метров.
"""
"""
num = int(input())
print(num // 100)
"""

# v2
print(int(input()) // 100)
