# До КОНЦА 1

"""
На вход программе подается последовательность слов, каждое слово на отдельной строке.
Концом последовательности является слово «КОНЕЦ» (без кавычек). Напишите программу, которая выводит члены данной последовательности.

Формат входных данных
На вход программе подается последовательность слов, каждое слово на отдельной строке.
"""

text_exit = ''
while text_exit != 'КОНЕЦ':
    print(text_exit)
    text_exit = input()
