# Дробная часть
# Дано положительное действительное число. Выведите его дробную часть.

num = float(input())
print(num % 1)

print(float(input()) % 1)
