# Площадь треугольника

# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.

a, b = input(), input()
print((float(a) * float(b)) / 2)

# v1.1
print(float(input()) * float(input()) / 2)
