# СУММА ТРЕХ ЧИСЕЛ
# Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.

number1 = int(input())
number2 = int(input())
number3 = int(input())

sum = number1 + number2 + number3
print(sum)


#print(int(input()) + int(input()) + int(input()))