# Четное или нечетное?
# Напишите программу, которая определяет, является число четным или нечетным.

num = int(input())

if(num%2 == 0):
    print('Число четное')
else:
    print('Число нечетное')